/* eslint-disable react/no-unescaped-entities */
import NavbarSectionAr from "@/app/component/NavbarSectionAr";
import FooterSectionAr from "@/app/component/FooterSectionAr";
import PrivacyPages from "@/app/component/PrivacyPages";

const privacyPolicySections = [
    {
      title: "سياسة الخصوصية",
      content: (
        <p>
          خصوصيتك مهمة جداً بالنسبة لنا. بناءً على ذلك، قمنا بتطوير سياسة الخصوصية هذه لمساعدتك على فهم كيفية جمع واستخدام والتواصل والكشف عن واستخدام المعلومات الشخصية. إذا كنت لا توافق على شروط سياسة الخصوصية هذه، فلا تستخدم موقعنا الإلكتروني أو تطبيق الهاتف المحمول أو التطبيق التجاري أو التطبيق الخاص بالمستهلك. إن استمرارك في استخدام موقعنا الإلكتروني أو تطبيق الهاتف المحمول أو التطبيق التجاري أو تطبيق المستهلك يعد بمثابة موافقتك الصريحة والموافقة على معالجة بياناتك الشخصية وفقاً لهذه السياسة. المصطلحات التي تظهر بحروف كبيرة في سياسة الخصوصية هذه لها المعنى المحدد ما لم تكن غير معرفة، وفي هذه الحالة يكون لها المعنى المحدد في شروط الاستخدام.
        </p>
      ),
    },
    {
      title: "أنواع المعلومات التي يتم جمعها",
      content: (
        <>
          <p>
            • قبل أو عند جمع المعلومات الشخصية، سنحدد الأغراض التي يتم جمع المعلومات من أجلها.
          </p>
          <p>
            • هناك مناطق في موقعنا الإلكتروني أو تطبيق الهاتف المحمول أو التطبيق التجاري أو تطبيق المستهلك حيث يمكنك مشاركة معلومات فريدة لشخص ما، مثل اسمك ورقم هاتفك وعنوان بريدك الإلكتروني ومعلومات بطاقة الائتمان ("المعلومات الشخصية"). نطلب هذه المعلومات لتقديم الخدمات والمنتجات المطلوبة لك أو للرد على أسئلتك أو لتقديم منتج. إذا تواصلت معنا عبر البريد الإلكتروني أو أكملت النماذج عبر الإنترنت، قد نحتاج إلى معلومات شخصية تحدد هويتك.
          </p>
          <p>
            معلومات الدفع: عندما تسجل لاستخدام موقع أو تطبيق SaloonGlow، قد نقوم بجمع البيانات اللازمة لمعالجة المدفوعات المرتبطة بعملية شراء أو طلب. قد تشمل معلومات الدفع رقم وسيلة الدفع الخاصة بك (مثل رقم بطاقة الائتمان) ورمز الأمان المرتبط بوسيلة الدفع الخاصة بك. يتم تخزين جميع بيانات الدفع بواسطة بوابة دفع آمنة من طرف ثالث.
          </p>
          <p>
            الإشعارات الدفعية: قد نطلب إرسال إشعارات دفعية لك بشأن حسابك أو التطبيق المحمول. إذا كنت ترغب في إيقاف تلقي هذه الأنواع من الاتصالات، يمكنك إيقافها في إعدادات جهازك أو إرسال بريد إلكتروني لنا على support@SaloonGlow.com.
          </p>
          <p>
            • نحن لا نجمع معلومات من أي شخص تحت سن 18 عامًا عن علم. يمكن للأولياء الاتصال بنا للوصول إلى أو تغيير أو حذف المعلومات الشخصية المقدمة من طفل.
          </p>
        </>
      ),
    },
    {
      title: "استخدام المعلومات الشخصية المجمعة",
      content: (
        <ul>
          <li className="textPara">
            نحن نجمع ونستخدم المعلومات الشخصية فقط بهدف تحقيق الأغراض المحددة ما لم يكن هناك ما يوجب خلاف ذلك بموجب القانون.
          </li>
          <li className="textPara">
            قد يتم استخدام المعلومات الشخصية لتخصيص تجربتك على موقعنا.
          </li>
          <li className="textPara">
            يتم الاحتفاظ بالمعلومات الشخصية فقط طالما كانت ضرورية لهذه الأغراض.
          </li>
          <li className="textPara">
            نحن نحمي المعلومات الشخصية من خلال تدابير أمان معقولة ضد الفقدان والسرقة والوصول غير المصرح به.
          </li>
        </ul>
      ),
    },
    {
      title: "متى سيتم مشاركة المعلومات؟",
      content: (
        <p>
          نشارك بياناتك مع مقدمي الخدمة أو الشركات التابعة لنا أو عند الضرورة بموجب القانون. أي نقل للبيانات يتوافق مع سياسة الخصوصية لدينا ويشمل الضمانات اللازمة.
        </p>
      ),
    },
    {
      title: "الكوكيز",
      content: (
        <p>
          يستخدم SaloonGlow الكوكيز لتحسين تجربة التصفح الخاصة بك. تساعدنا الكوكيز في تذكر هويتك وتحليل النشاط المستخدم وتحسين الخدمات. يمكنك تعطيل الكوكيز في إعدادات متصفحك، ولكن قد لا تعمل بعض الميزات بدونها.
        </p>
      ),
    },
    {
      title: "التغييرات على سياسة الخصوصية",
      content: (
        <p>
          يحتفظ SaloonGlow بالحق في تحديث سياسة الخصوصية هذه في أي وقت. تكون التغييرات سارية فور نشرها. نوصي بمراجعة هذه الصفحة بانتظام للتحديثات.
        </p>
      ),
    },
    {
      title: "كيف نحافظ على أمان معلوماتك؟",
      content: (
        <p>
          يطبق SaloonGlow تدابير أمان مثل التشفير والتكنولوجيا الآمنة والوصول المحدود من الموظفين لحماية بياناتك. على الرغم من أننا نتخذ تدابير لتأمين معلوماتك، إلا أنه لا يوجد نظام آمن بنسبة 100%.
        </p>
      ),
    },
  ];

export default function Home() {
  return ( 
    <>
      <NavbarSectionAr />
      <PrivacyPages sections={privacyPolicySections} />
      <FooterSectionAr />
    </>
  );
}
